## Mengimport Modul

In [2]:
import pandas as pd


print (pd.__version__)

1.2.4

## Membuat sebuah data Frame

In [3]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()
#sebuah data frame yang mempunyai data yang hilang /NaN

E:\Anaconda\lib\site-packages\pandas\util\__init__.py:8: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

        index         A         B         C         D
0  JSUZrrI998  0.204117  0.178278  1.068183 -0.242753
1  phn9M1o3gB -0.593396  0.057915 -0.557200 -1.134062
2  z2onXFcacE  1.883420 -1.568830  0.196308  2.070998
3  Ars5SsEajT       NaN  1.078451  0.660316       NaN
4  eXHSbFK8mw -2.452783       NaN  1.378086 -1.268497

In [6]:
df= df.rename(columns={'index':'z'})
df.head()

            z         A         B         C         D
0  JSUZrrI998  0.204117  0.178278  1.068183 -0.242753
1  phn9M1o3gB -0.593396  0.057915 -0.557200 -1.134062
2  z2onXFcacE  1.883420 -1.568830  0.196308  2.070998
3  Ars5SsEajT       NaN  1.078451  0.660316       NaN
4  eXHSbFK8mw -2.452783       NaN  1.378086 -1.268497

In [15]:
df_backup=df.copy(deep=True)
df.head()

            z
0  JSUZrrI998
1  phn9M1o3gB
2  z2onXFcacE
3  Ars5SsEajT
4  eXHSbFK8mw

## Menghapus setiap kolom yang mengandung NaN

In [12]:
df=df.dropna(axis='columns')
df.head()

            z
0  JSUZrrI998
1  phn9M1o3gB
2  z2onXFcacE
3  Ars5SsEajT
4  eXHSbFK8mw

# Menghapus setiap baris yang mengandung Mising Value

In [16]:
df=df_backup.copy(deep=True)
df=df.dropna(axis='rows')
df.head()

            z
0  JSUZrrI998
1  phn9M1o3gB
2  z2onXFcacE
3  Ars5SsEajT
4  eXHSbFK8mw

### Presentase Mising value

In [17]:
df=df_backup.copy(deep=True)
df.isna().mean()

z    0.0
dtype: float64

# Menghapus setiap kolom bedasarkan value threshold

In [18]:
treshold=len(df)*0.9
df= df.dropna(thresh=treshold,axis="columns")
df.head()

            z
0  JSUZrrI998
1  phn9M1o3gB
2  z2onXFcacE
3  Ars5SsEajT
4  eXHSbFK8mw